RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="QEO0">
      <name>QEO1</name>
      <description>QEO1</description>
      <groupName>QEOV2</groupName>
      <baseAddress>0xf0414000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="QEO0">
      <name>QEO2</name>
      <description>QEO2</description>
      <groupName>QEOV2</groupName>
      <baseAddress>0xf0418000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="QEO0">
      <name>QEO3</name>
      <description>QEO3</description>
      <groupName>QEOV2</groupName>
      <baseAddress>0xf041c000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>PWM0</description>
      <groupName>PWMV2</groupName>
      <baseAddress>0xf0420000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x980</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>work_ctrl0</name>
          <description>No description available</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>SHADOW_UNLOCK</name>
              <description>write 0x… first to unlock, then set related bits in unlock_sel to unlock following shadow registers(from 0x04 to 0x78),
otherwise the shadow registers can not be written.
The shadow registers will be loaded to work registers only when shadow_lock is 1 or lock is not enabled
This bit can be cleared by set shadow_lock bit in work_ctrl1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>unlock</name>
          <description>No description available</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNLOCK_BIT</name>
              <description>bit2 to bit 29 for value_shadow, bit30 for force_mode
the shadow registers can be updated only when related unlock_bit is set;
this register can only be updated after unlock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>28</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27</dimIndex>
          <name>SHADOW_VAL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>shadow registers, if used as reload or compare point, shall be 24bit clock cycles plus 1bit half cycle and 7bit high-resolution delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>force_mode</name>
          <description>No description available</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>POLARITY</name>
              <description>one bit for one pwm channel, it's used as shadow register when pwm_cfg0.polarity_opt0 is set.
output polarity, set to 1 will invert the output(after pwm selection, pair mode, dead area insertion, before force/fault)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MODE</name>
              <description>2bit for each PWM channel(0~7);
00:  force output 0
01:  force output 1
10:  output highz(pad_oe_*=0)
11:  no force
this field may be changed by software as shadow register , the update time should be defined by chan_cfg.load, only for PWM channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>work_ctrl1</name>
          <description>No description available</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHADOW_LOCK</name>
              <description>one to lock,  sofware can't write any shadow registers
Software have to write 0x…. to work_ctrl0 to clear this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>PWM[%s]</name>
          <description>no description available</description>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>cfg0</name>
            <description>No description available</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x01000F77</resetMask>
            <fields>
              <field>
                <name>TRIG_SEL4</name>
                <description>for N=0/2/4/6, clear to select 2 compare point(N*2~N*2+1);
set to select 4 compare point(N*2~N*2+3);
or use 2 compare point(N*2+2~N*2+3);
for N=1/3/5/7, this bit is no means, it can work on pair mode, or use 2 compare point (N*2+2~N*2+3);
assume select ab or abcd,  abcd can between 0 and 2T.
output will be 1 when counter value between a and b;
if b&lt;=a then output all 0; if b&gt;=(T+a), then output all 1;</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_SEL_ASYNC</name>
                <description>select from 16bit async fault from pad</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_POL_ASYNC</name>
                <description>fault polarity for input fault from pad, 1-active low;  0-active high;</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_EN_ASYNC</name>
                <description>set to enable the input async faults from pad directly</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_EN_SYNC</name>
                <description>set to enable the input faults from trig_mux(trigger_in[0] for channel0/1, 1 for 23, 2 for 45, 3 for 67)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POL_UPDATE_SEL</name>
                <description>used when polarity_opt0 is set, define when to update polarity working register.
0:  software set work_ctrl1.shadow_lock bit
1:  update at reload point;</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_POLARITY</name>
                <description>output polarity, set to 1 will invert the output(after pwm selection, pair mode, dead area insertion, before force/fault)
when polarity_opt0 is set, this bit is controlled by shadow register, can't be writable; read as working register
use compare channel settings(in cmp_cfg) as shadow register update</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POLARITY_OPT0</name>
                <description>set to use shadow polarity</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>cfg1</name>
            <description>No description available</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1FFF7777</resetMask>
            <fields>
              <field>
                <name>HIGHZ_EN_N</name>
                <description>0 to highz pwm outputs(pad_oe*=0), software need set this bit to 1 to enable pwm output</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_UPDATE_TIME</name>
                <description>define when to use the shadow register value for working register(force_mode)
00:  software set work_ctrl1.shadow_lock bit
01:  use the related counter rld_cmp_sel0 and rld_cmp_sel1, to select one compare point
10:  related counter reload time(selected by pwm_cnt)
11:  use force_trig_sel to select one of the input trigger
NOTE: 00/01 are not recommended since the update time is not controllable, may cause error in complex application.
00 is used for initialization or debug, not suggest for real time update</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_MODE</name>
                <description>00:  force output 0
01:  force output 1
1x:  output highz(pad_oe_*=0)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_REC_TIME</name>
                <description>00:  immediately
01:  after main counter reload time
10:  use fault_rec_sel to select one of the input trigger
11:  software write fault_clear in glb_ctrl2, no effort if pwm_fault is still assert</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SW_FORCE_EN</name>
                <description>0 for hardware force, from trig_mux selected by pwm_force_sel
1 for software force, from glb_ctrl.sw_force</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAIR_MODE</name>
                <description>if set to 1, PWM work at pair mode,
pwm_cfg for channel 2m is used for channel 2m+1(m=0,1,2,3),
except the dead area, which is separate for each channel even in pair mode
software need set this bit for both channel of one pair, otherwise result unknown.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PWM_LOGIC</name>
                <description>valid only for pwm0/2/4/6 when trig_sel4 is set
00:  ab OR cd;
01:  ab AND cd;
10:  ab XOR cd;
11:  cd</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_TIME</name>
                <description>00:  force immediately
01:  force at main counter reload time
10:  force at trig signal selected by force_act_sel
11: no force
the force assert/deassert will happen at the force_time;
qeo force and value also latched at this time</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_TRIG_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux, will load shadow register(force)mode) to force_mode_work at this time</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FORCE_ACT_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux, will load hw/sw force at this time</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PWM_FORCE_SEL</name>
                <description>select one trigger from 8 as force signal, should be level signal, 1 for force active, 0 for no force</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FAULT_REC_SEL</name>
                <description>select one trigger from 8, should set to pulse in trig_mux, used for fault recovery if fault_rec_time is set to 2'b10</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>dead_area</name>
            <description>No description available</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00FFFFFF</resetMask>
            <fields>
              <field>
                <name>DEAD_AREA</name>
                <description>16bit cycle delay plus 8bit hr_delay
min value is 2 cycles, less than 0x200 will be treated as no dead area;
NOTE: dead insertion must be configured with pair, that is, for pwm 01/23/45/67.
otherwise the result maybe UNKNOWN!!!</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>TRIGGER_CFG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TRIGGER_OUT_SEL</name>
              <description>select one from 24 compare result as trigger out, set at compare point, clear at reload point.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>glb_ctrl</name>
          <description>No description available</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF0318</resetMask>
          <fields>
            <field>
              <name>SW_FORCE</name>
              <description>software write 1 to start software force, if the pwm_cfg&lt;n&gt;.sw_force_en is set, force will take effort</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_DELAY</name>
              <description>add delay after dead_area insertiong logic, for hr_pwm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HR_PWM_EN</name>
              <description>set to enable hr pwm, clear to bypass delay chain.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC_DISABLE</name>
              <description>set to disable bit[7:0] in DAC value when Calculation Unit use it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>glb_ctrl2</name>
          <description>No description available</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F20FF01</resetMask>
          <fields>
            <field>
              <name>DAC_SW_MODE</name>
              <description>set for software DAC mode, software can write dac_value*_sv directly, and dac_valid from moto system is ignored</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_IN_EN</name>
              <description>set to enable debug_in signal as fault signal, generally disable pwm output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT_CLEAR</name>
              <description>software write 1 to clear fault event if pwm_cfg.fault_rec_time is 2'b11.
software need to clear it after the fault signal is de-assert and before next fault
one bit for one pwm channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHADOW_LOCK_EN</name>
              <description>enable shadow_lock feature, if cleared, shadow_lock will be always 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CNT_RELOAD_WORK[%s]</name>
          <description>no description available</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>counter0 reload working register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>24</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23</dimIndex>
          <name>CMP_VAL_WORK[%s]</name>
          <description>no description available</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>compare point working register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>force_work</name>
          <description>No description available</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_POLARITY</name>
              <description>force working register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_MODE</name>
              <description>force_mode work register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CNT_VAL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>main counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>DAC_VALUE_SV[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>save dac0_value when dac0_valid if dac_sw_mode is 0;
software write dac_value directly if dac_sw_mode is 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
