RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SEI</name>
      <description>SEI</description>
      <groupName>SEI</groupName>
      <baseAddress>0xf0470000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>13</dim>
          <dimIncrement>0x400</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12</dimIndex>
          <name>CTRL[%s]</name>
          <description>no description available</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>ENGINE_CTRL</name>
            <description>Engine control register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WATCH</name>
                <description>Enable watch dog
0: Watch dog disabled
1: Watch dog enabled</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ARMING</name>
                <description>Wait for trigger before excuting
0: Execute on enable
1: Wait trigger before exection after enabled</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXCEPT</name>
                <description>Explain timout as exception
0: when timeout, pointer move to next instruction
1: when timeout, pointer jump to timeout vector</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REWIND</name>
                <description>Rewind execution pointer
0: run
1: clean status and rewind</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable
0: disable
1: enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_PTR_CFG</name>
            <description>Pointer configuration register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFF1FFFFF</resetMask>
            <fields>
              <field>
                <name>DAT_CDM</name>
                <description>Select DATA register to receive CDM bit in BiSSC slave mode
0: ignore
1: command
2: data register 2
3: data register 3
...
29:data register 29
30: value 0 when send, ignore in receive
31: value1 when send, ignore in receive</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DAT_BASE</name>
                <description>Bias for data register access, if calculated index bigger than 32, index will wrap around
0: real data index
1: access index is 1 greater than instruction address
2: access index is 2 greater than instruction address
...
31: access index is 31 greater than instruction address</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POINTER_WDOG</name>
                <description>Pointer to the instruction that the program starts executing after the instruction timeout. The timeout is WDOG_TIME</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POINTER_INIT</name>
                <description>Initial execute pointer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_WDG_CFG</name>
            <description>Watch dog configuration register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>WDOG_TIME</name>
                <description>Time out count for each instruction, counter in bit time.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_EXE_STA</name>
            <description>Execution status</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00110101</resetMask>
            <fields>
              <field>
                <name>TRIGERED</name>
                <description>Execution has been triggered
0: Execution not triggered
1: Execution triggered</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ARMED</name>
                <description>Waiting for trigger for execution
0: Not in waiting status
1: In waiting status</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXPIRE</name>
                <description>Watchdog timer expired
0: Not expired
1: Expired</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>STALL</name>
                <description>Program finished
0: Program is executing
1: Program finished</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_EXE_PTR</name>
            <description>Execution pointer</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1F1F00FF</resetMask>
            <fields>
              <field>
                <name>HALT_CNT</name>
                <description>Halt count in halt instrution</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BIT_CNT</name>
                <description>Bit count in send and receive instruction execution</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>POINTER</name>
                <description>Current program pointer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_EXE_INST</name>
            <description>Execution instruction</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INST</name>
                <description>Current instruction</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENGINE_WDG_STA</name>
            <description>Watch dog status</description>
            <addressOffset>0x1c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>WDOG_CNT</name>
                <description>Current watch dog counter value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_CTRL</name>
            <description>Transceiver control register</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TRISMP</name>
                <description>Tipple sampe
0: sample 1 time for data transition
1: sample 3 times in receive and result in 2oo3</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAR_CLR</name>
                <description>Clear parity error, this is a self clear bit
0: no effect
1: clear parity error</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RESTART</name>
                <description>Restart tranceiver, this is a self clear bit
0: no effect
1: reset tranceiver</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MODE</name>
                <description>Tranceiver mode
0: synchronous maaster
1: synchronous slave
2: asynchronous mode
3: asynchronous mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_TYPE_CFG</name>
            <description>Transceiver configuration register</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WAIT_LEN</name>
                <description>Number of extra stop bit for asynchronous mode
0: 1 bit
1: 2 bit
...
255: 256 bit</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_LEN</name>
                <description>Number of data bit for asynchronous mode
0: 1 bit
1: 2 bit
...
31: 32 bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAR_POL</name>
                <description>Polarity of parity for asynchronous mode
0: even
1: odd</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAR_EN</name>
                <description>enable parity check for asynchronous mode
0: disable
1: enable</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DA_IDLEZ</name>
                <description>Idle state driver of data line
0: output
1: high-Z</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CK_IDLEZ</name>
                <description>Idle state driver of clock line
0: output
1: high-Z</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DA_IDLEV</name>
                <description>Idle state value of data line
0: data'0'
1: data'1'</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CK_IDLEV</name>
                <description>Idle state value of clock line
0: data'0'
1: data'1'</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_BAUD_CFG</name>
            <description>Transceiver baud rate register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SYNC_POINT</name>
                <description>Baud synchronous time, minmum bit time</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BAUD_DIV</name>
                <description>Baud rate, bit time in system clock cycle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_DATA_CFG</name>
            <description>Transceiver data timing configuration</description>
            <addressOffset>0x2c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TXD_POINT</name>
                <description>data transmit point  in system clcok cycle</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXD_POINT</name>
                <description>data receive point in system clcok cycle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_CLK_CFG</name>
            <description>Transceiver clock timing configuration</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CK1_POINT</name>
                <description>clock point 1 in system clcok cycle</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CK0_POINT</name>
                <description>clock point 0 in system clcok cycle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_PIN</name>
            <description>Transceiver pin status</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x07070707</resetMask>
            <fields>
              <field>
                <name>OE_CK</name>
                <description>CK drive state
0: input
1: output</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DI_CK</name>
                <description>CK state
0: data 0
1: data 1</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DO_CK</name>
                <description>CK output
0: data 0
1: data 1</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OE_RX</name>
                <description>RX drive state
0: input
1: output</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DI_RX</name>
                <description>RX state
0: data 0
1: data 1</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DO_RX</name>
                <description>RX output
0: data 0
1: data 1</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OE_DE</name>
                <description>DE drive state
0: input
1: output</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DI_DE</name>
                <description>DE state
0: data 0
1: data 1</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DO_DE</name>
                <description>DE output
0: data 0
1: data 1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OE_TX</name>
                <description>TX drive state
0: input
1: output</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DI_TX</name>
                <description>TX state
0: data 0
1: data 1</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DO_TX</name>
                <description>TX output
0: data 0
1: data 1</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>XCVR_STATE</name>
            <description>FSM of asynchronous</description>
            <addressOffset>0x3c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x07070000</resetMask>
            <fields>
              <field>
                <name>RECV_STATE</name>
                <description>FSM of asynchronous receive</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SEND_STATE</name>
                <description>FSM of asynchronous transmit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
