RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
          <register>
            <name>TRG_IN_CFG</name>
            <description>Trigger input configuration</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x83878787</resetMask>
            <fields>
              <field>
                <name>REWIND_EN</name>
                <description>enable rewind cmd register by LATCH</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REWIND_SEL</name>
                <description>select one LATCH to rewind CMD register
0:LATCH[0]
1:LATCH[1]
2:LATCH[2]
3:LATCH[3]</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PRD_EN</name>
                <description>Enable period trigger (tigger 2)
0: periodical trigger disabled
1: periodical trigger enabled</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC_SEL</name>
                <description>Synchronize sigal selection (tigger 2)
0: trigger in 0
1: trigger in 1
...
7: trigger in 7</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN1_EN</name>
                <description>Enable trigger 1
0: disable trigger 1
1: enable trigger 1</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN1_SEL</name>
                <description>Trigger 1 sigal selection
0: trigger in 0
1: trigger in 1
...
7: trigger in 7</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN0_EN</name>
                <description>Enable trigger 0
0: disable trigger 1
1: enable trigger 1</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN0_SEL</name>
                <description>Trigger 0 sigal selection
0: trigger in 0
1: trigger in 1
...
7: trigger in 7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_SW</name>
            <description>Software trigger</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>SOFT</name>
                <description>Software trigger (tigger 3). this bit is self-clear
0: trigger source disabled
1: trigger source enabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_PRD_CFG</name>
            <description>Period trigger configuration</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF0001</resetMask>
            <fields>
              <field>
                <name>ARMING</name>
                <description>Wait for trigger synchronous before trigger
0: Trigger directly
1: Wait trigger source before period trigger</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNC</name>
                <description>Synchronous
0: Not synchronous
1: Synchronous every trigger source</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_PRD</name>
            <description>Trigger period</description>
            <addressOffset>0x4c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIOD</name>
                <description>Trigger period</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_OUT_CFG</name>
            <description>Trigger output configuration</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x87878787</resetMask>
            <fields>
              <field>
                <name>OUT3_EN</name>
                <description>Enable trigger 3
0: disable trigger 3
1: enable trigger 3</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT3_SEL</name>
                <description>Trigger 3 sigal selection
0: trigger out 0
1: trigger out 1
...
7: trigger out 7</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT2_EN</name>
                <description>Enable trigger 2
0: disable trigger 2
1: enable trigger 2</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT2_SEL</name>
                <description>Trigger 2 sigal selection
0: trigger out 0
1: trigger out 1
...
7: trigger out 7</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT1_EN</name>
                <description>Enable trigger 1
0: disable trigger 1
1: enable trigger 1</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT1_SEL</name>
                <description>Trigger 1 sigal selection
0: trigger out 0
1: trigger out 1
...
7: trigger out 7</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT0_EN</name>
                <description>Enable trigger 0
0: disable trigger 1
1: enable trigger 1</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT0_SEL</name>
                <description>Trigger 0 sigal selection
0: trigger out 0
1: trigger out 1
...
7: trigger out 7</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_PRD_STS</name>
            <description>Period trigger status</description>
            <addressOffset>0x60</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00110000</resetMask>
            <fields>
              <field>
                <name>TRIGERED</name>
                <description>Period has been triggered
0: Not triggered
1: Triggered</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ARMED</name>
                <description>Waiting for trigger
0: Not in waiting status
1: In waiting status</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TRG_PRD_CNT</name>
            <description>Period trigger counter</description>
            <addressOffset>0x64</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIOD_CNT</name>
                <description>Trigger period counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>TRG_TABLE_CMD[%s]</name>
            <description>no description available</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TRIGGER0</name>
                <description>Trigger command</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>TRG_TABLE_TIME[%s]</name>
            <description>no description available</description>
            <addressOffset>0xa0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TRIGGER0_TIME</name>
                <description>Trigger time</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_MODE</name>
            <description>command register mode</description>
            <addressOffset>0xc0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE0FFCFFF</resetMask>
            <fields>
              <field>
                <name>WLEN</name>
                <description>word length
0: 1 bit
1: 2 bit
...
31: 32 bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WORDER</name>
                <description>word order
0: sample as bit order
1: different from bit order</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>BORDER</name>
                <description>bit order
0: LSB first
1: MSB first</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SIGNED</name>
                <description>Signed
0: unsigned value
1: signed value</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REWIND</name>
                <description>Write 1 to rewind read/write pointer, this is a self clear bit</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>MODE</name>
                <description>Data mode(CMD register only support data mode)
0: data mode
1: check mode
2: CRC mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_IDX</name>
            <description>command register configuration</description>
            <addressOffset>0xc4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LAST_BIT</name>
                <description>Last bit index for tranceive</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FIRST_BIT</name>
                <description>First bit index for tranceive</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MAX_BIT</name>
                <description>Highest bit index</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MIN_BIT</name>
                <description>Lowest bit index</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_CMD</name>
            <description>command</description>
            <addressOffset>0xe0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>DATA</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_SET</name>
            <description>command bit set register</description>
            <addressOffset>0xe4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_SET</name>
                <description>DATA bit set</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_CLR</name>
            <description>command bit clear register</description>
            <addressOffset>0xe8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_CLR</name>
                <description>DATA bit clear</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_INV</name>
            <description>command bit invert register</description>
            <addressOffset>0xec</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_TGL</name>
                <description>DATA bit toggle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_IN</name>
            <description>Commad input</description>
            <addressOffset>0xf0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_IN</name>
                <description>Commad input</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_OUT</name>
            <description>Command output</description>
            <addressOffset>0xf4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_OUT</name>
                <description>Command output</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD_STS</name>
            <description>Command status</description>
            <addressOffset>0xf8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xE0FFFFFF</resetMask>
            <fields>
              <field>
                <name>WORD_IDX</name>
                <description>Word index</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>WORD_CNT</name>
                <description>Word counter</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BIT_IDX</name>
                <description>Bit index</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x20</dimIncrement>
            <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
            <name>CMD_CMD_TABLE[%s]</name>
            <description>no description available</description>
            <addressOffset>0x100</addressOffset>
            <register>
              <name>MIN</name>
              <description>command start value</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CMD_MIN</name>
                  <description>minimum command value</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MAX</name>
              <description>command end value</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CMD_MAX</name>
                  <description>maximum command value</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MSK</name>
              <description>command compare bit enable</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>CMD_MASK</name>
                  <description>compare mask</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PTA</name>
              <description>command pointer 0 - 3</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>PTR3</name>
                  <description>pointer3</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR2</name>
                  <description>pointer2</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR1</name>
                  <description>pointer1</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR0</name>
                  <description>pointer0</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
