RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
            <register>
              <name>PTB</name>
              <description>command pointer 4 - 7</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>PTR7</name>
                  <description>pointer7</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR6</name>
                  <description>pointer6</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR5</name>
                  <description>pointer5</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR4</name>
                  <description>pointer4</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PTC</name>
              <description>command pointer 8 - 11</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>PTR11</name>
                  <description>pointer11</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR10</name>
                  <description>pointer10</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR9</name>
                  <description>pointer9</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR8</name>
                  <description>pointer8</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>PTD</name>
              <description>command pointer 12 - 15</description>
              <addressOffset>0x1c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>PTR15</name>
                  <description>pointer15</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR14</name>
                  <description>pointer14</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR13</name>
                  <description>pointer13</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PTR12</name>
                  <description>pointer12</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>4</dim>
            <dimIncrement>0x20</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CMD_LATCH[%s]</name>
            <description>no description available</description>
            <addressOffset>0x200</addressOffset>
            <register>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>0_1,1_2,2_3,3_0</dimIndex>
              <name>TRAN[%s]</name>
              <description>no description available</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFF0FFFFF</resetMask>
              <fields>
                <field>
                  <name>POINTER</name>
                  <description>pointer</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CFG_TM</name>
                  <description>timeout
0: high
1: low
2: rise
3: fall</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CFG_RXD</name>
                  <description>data received
0: high
1: low
2: rise
3: fall</description>
                  <bitOffset>14</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CFG_TXD</name>
                  <description>data send
0: high
1: low
2: rise
3: fall</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CFG_CLK</name>
                  <description>clock
0: high
1: low
2: rise
3: fall</description>
                  <bitOffset>10</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CFG_PTR</name>
                  <description>pointer
0: match
1: not match
2:entry
3:leave</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OV_TM</name>
                  <description>override timeout check</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OV_RXD</name>
                  <description>override RX data check</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OV_TXD</name>
                  <description>override TX data check</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OV_CLK</name>
                  <description>override clock check</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>OV_PTR</name>
                  <description>override pointer check</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CFG</name>
              <description>Latch configuration</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x8700FFFF</resetMask>
              <fields>
                <field>
                  <name>EN</name>
                  <description>Enable latch
0: disable
1: enable</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SELECT</name>
                  <description>Output select
0: state0-state1
1: state1-state2
2: state2-state3
3: state3-state0</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DELAY</name>
                  <description>Delay in system clock cycle, for state transition</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TIME</name>
              <description>Latch time</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>LAT_TIME</name>
                  <description>Latch time</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>STS</name>
              <description>Latch status</description>
              <addressOffset>0x1c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0700FFFF</resetMask>
              <fields>
                <field>
                  <name>STATE</name>
                  <description>State</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>LAT_CNT</name>
                  <description>Latch counter</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>POS_SMP_EN</name>
            <description>Sample selection register</description>
            <addressOffset>0x280</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ACC_EN</name>
                <description>Position include acceleration
0: use acceleration from sample override acceleration register
1: use acceleration from motor group</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_SEL</name>
                <description>Data register for acceleration transfer</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SPD_EN</name>
                <description>Position include speed
0: use speed from sample override speed register
1: use speed from motor group</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SPD_SEL</name>
                <description>Data register for speed transfer</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_EN</name>
                <description>Position include revolution
0: use revolution from sample override revolution register
1: use revolution  from motor group</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_SEL</name>
                <description>Data register for revolution transfer</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_EN</name>
                <description>Position include position
0: use position from sample override position register
1: use position from motor group</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_SEL</name>
                <description>Data register for position transfer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_CFG</name>
            <description>Sample configuration</description>
            <addressOffset>0x284</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0103FFFF</resetMask>
            <fields>
              <field>
                <name>ONCE</name>
                <description>Sample one time
0: Sample during windows time
1: Close sample window after first sample</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LAT_SEL</name>
                <description>Latch selection
0: latch 0
1: latch 1
2: latch 2
3: latch 3</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WINDOW</name>
                <description>Sample window, in clock cycle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_DAT</name>
            <description>Sample data</description>
            <addressOffset>0x288</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DAT_SEL</name>
                <description>Data register sampled, each bit represent a data register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_POS</name>
            <description>Sample override position</description>
            <addressOffset>0x290</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>POS</name>
                <description>Sample override position</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_REV</name>
            <description>Sample override revolution</description>
            <addressOffset>0x294</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REV</name>
                <description>Sample override revolution</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_SPD</name>
            <description>Sample override speed</description>
            <addressOffset>0x298</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPD</name>
                <description>Sample override speed</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_SMP_ACC</name>
            <description>Sample override accelerate</description>
            <addressOffset>0x29c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ACC</name>
                <description>Sample override accelerate</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_UPD_EN</name>
            <description>Update configuration</description>
            <addressOffset>0x2a0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ACC_EN</name>
                <description>Position include acceleration
0: use acceleration from update override acceleration register
1: use acceleration from data register</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACC_SEL</name>
                <description>Data register for acceleration transfer</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SPD_EN</name>
                <description>Position include speed
0: use speed from update override speed register
1: use speed from data register</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SPD_SEL</name>
                <description>Data register for speed transfer</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_EN</name>
                <description>Position include revolution
0: use revolution from update override revolution register
1: use revolution from data register</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>REV_SEL</name>
                <description>Data register for revolution transfer</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_EN</name>
                <description>Position include position
0: use position from update override position register
1: use position from data register</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>POS_SEL</name>
                <description>Data register for position transfer</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_UPD_CFG</name>
            <description>Update configuration</description>
            <addressOffset>0x2a4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x81030000</resetMask>
            <fields>
              <field>
                <name>TIME_OVRD</name>
                <description>Use override time
0: use time sample from motor group
1: use override time</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ONERR</name>
                <description>Sample one time
0: Sample during windows time
1: Close sample window after first sample</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LAT_SEL</name>
                <description>Latch selection
0: latch 0
1: latch 1
2: latch 2
3: latch 3</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>POS_UPD_DAT</name>
            <description>Update data</description>
            <addressOffset>0x2a8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DAT_SEL</name>
                <description>Data register sampled, each bit represent a data register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
