RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
          <register>
            <name>eadc_pre0</name>
            <description>&amp;index0 error adc previous0 value</description>
            <addressOffset>0xb0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_PRE0</name>
                <description>error adc previous 0 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>eadc_pre1</name>
            <description>&amp;index0 error adc previous1 value</description>
            <addressOffset>0xb4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EADC_PRE1</name>
                <description>error adc previous 1 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p2z2_curr</name>
            <description>&amp;index0 2p2z latest value</description>
            <addressOffset>0xb8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>2P2Z_CURR</name>
                <description>2p2z latest value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p2z2_pre0</name>
            <description>&amp;index0 2p2z previous0 value</description>
            <addressOffset>0xbc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>2P2Z_PRE0</name>
                <description>2p2z previous 0 value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_curr</name>
            <description>&amp;index0 3p3z latest value</description>
            <addressOffset>0xc4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_CURR</name>
                <description>3p3z latest value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_forbid_lo</name>
            <description>&amp;index0 3p3z output forbid low threshold</description>
            <addressOffset>0xcc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_FORBID_LO</name>
                <description>3p3z output forbid low threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_forbid_md</name>
            <description>&amp;index0 3p3z output forbid middle threshold</description>
            <addressOffset>0xd0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_FORBID_MD</name>
                <description>3p3z output forbid middle threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>p3z3_forbid_hi</name>
            <description>&amp;index0 3p3z output forbid high threshold</description>
            <addressOffset>0xd4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>3P3Z_FORBID_HI</name>
                <description>3p3z output forbid high threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>adc_sw</name>
            <description>&amp;index0 adc software inject value</description>
            <addressOffset>0xe0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC_SW</name>
                <description>adc software inject value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>status</name>
            <description>&amp;index0 irq_status</description>
            <addressOffset>0xfc</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000007FF</resetMask>
            <fields>
              <field>
                <name>STATUS</name>
                <description>status, write 1 to clear it. :
irq_data_in_forbid     , // 10
irq_forb_err_boundary  , // 9
irq_p3z3_over_lo       , // 8
irq_p3z3_over_hi       , // 7
irq_p3z3_err_boundary  , // 6
irq_z2_over_sf         , // 5
irq_z2_over_lo         , // 4
irq_z2_over_hi         , // 3
irq_z2_err_boundary    , // 2
irq_coef_err_boundary  , // 1
irq_valid_clc            // 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>dq_adc_sw_ready</name>
          <description>enable d/q chan software inject adc value</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>DQ_ADC_SW_READY</name>
              <description>enable d/q chan software inject adc value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
