RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
            <register>
              <name>MAC_IRQ_CTRL</name>
              <description>No description available</description>
              <addressOffset>0x30</addressOffset>
              <size>32</size>
              <resetValue>0x0000000C</resetValue>
              <resetMask>0x00000F0D</resetMask>
              <fields>
                <field>
                  <name>CAIF</name>
                  <description>Clock activity interrupt flag
0 – no interrupt
1 – interrupt pending
See Chapter 11.2.3 for details.</description>
                  <bitOffset>11</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SWIF</name>
                  <description>Safety warning interrupt flag
0 – no interrupt
1 – interrupt pending
See Chapter 11.2.2 for details</description>
                  <bitOffset>10</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SEIF</name>
                  <description>Safety Error Interrupt Flag
0 – no interrupt
1 – interrupt pending
If SEN=1 and if there is a mismatch between both instances of the logic core of
LLEMAC-1G then this results in SEIF=1, TX_EN=0 and RX_EN=0.</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MDIF</name>
                  <description>MDIO Interrupt Flag
1 – A transfer has been finished
0 – No transfer done</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CAIE</name>
                  <description>Clock activity interrupt enable
0 – CAIF disabled
1 – CAIF enabled</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SWIE</name>
                  <description>Safety warning interrupt enable
0 – SWIF disabled
1 – SWIF enabled</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MDIE</name>
                  <description>MDIO Interrupt Enable
0 – Disabled
1 – Enabled</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>RTC_CR</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x800</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000000E</resetMask>
            <fields>
              <field>
                <name>TAIE</name>
                <description>Timer A interrupt enable: interrupt enabled when 1</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TAEN</name>
                <description>Timer A enable: timer enabled when 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALIE</name>
                <description>Alarm interrupt enable: alarm interrupt enabled when 1</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_SR</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x804</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000000A</resetMask>
            <fields>
              <field>
                <name>TAIS</name>
                <description>Timer A Interrupt Status: set at rising edge of “timer_clk_a”, write 1 to clear</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ALIS</name>
                <description>ALIS ro Alarm Interrupt Status: Always set while RTC-Time &gt;= Alarm-Time</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_CT_CURTIME_NS</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x810</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>CT_NS</name>
                <description>Local Time (nanosecond part): Update can be triggered by write access to this register. Value range from 0 – 999999999.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_CT_CURTIME_SEC</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x814</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CT_SEC</name>
                <description>Current Time (second part): Update can be triggered by write access to register CURTIME_NS.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_CT_TIMER_INCR</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x81c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>NS</name>
                <description>Local time increment – nanoseconds (integer)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FNS</name>
                <description>Local time increment – fractional ns, unsigned, in (1 / 2^24) n</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_OFS_NS</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x820</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>OFS_NS</name>
                <description>Real Time Offset (nanoseconds part). Valid value range from 0 – 999999999.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_OFS_SL</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x824</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OFS_SL</name>
                <description>48 Bit Real Time Offset (seconds lo part)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_OFS_SH</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x828</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>OFS_SH</name>
                <description>48 Bit Real Time Offset (seconds hi part)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_OFS_CH</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x82c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEXT</name>
                <description>Real Time Offset Change – sign extension of SFNS (Bit 23)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SFNS</name>
                <description>Real Time Offset Change in fractional nanoseconds, signed value; value range from -2^23 / 2^24 to (2^23-1) / 2^24 nanoseconds.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_ALARM_NS</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x830</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x3FFFFFFF</resetMask>
            <fields>
              <field>
                <name>AL_NS</name>
                <description>Alarm Time (nanoseconds part). Valid value range from 0 – 999999999.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>30</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_ALARM_SL</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x834</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AL_SL</name>
                <description>Alarm Time (seconds lo part)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_ALARM_SH</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x838</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>AL_SH</name>
                <description>Alarm Time (seconds hi part)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RTC_TIMER_A_PERIOD</name>
            <description>ONLY IN PORT1</description>
            <addressOffset>0x840</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x1FFFFFFF</resetMask>
            <fields>
              <field>
                <name>PERIOD_NS</name>
                <description>Timer A Period in ns. This is the period of the timer until the next event, but the half-period of the signal “timer_a_clk”.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_CR</name>
            <description>No description available</description>
            <addressOffset>0x1004</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x001F1F07</resetMask>
            <fields>
              <field>
                <name>TMR_ALD</name>
                <description>Timer Auto Load: automatic reloading of timer when reaching 0. Done flag stays set after countdown. Used for periodic events, when following event shall not be delayed by host interaction.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TMR_EN</name>
                <description>Timer Enable: every bit corresponds to Timer 0 – 4</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TMRIE</name>
                <description>Timer Interrupt Enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RXIE</name>
                <description>Rx Interrupt Enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TXIE</name>
                <description>Tx Interrupt Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_SR</name>
            <description>No description available</description>
            <addressOffset>0x1008</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00001F07</resetMask>
            <fields>
              <field>
                <name>TMR_DN</name>
                <description>Timer Done: 1 when timer reached 0</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TMRIS</name>
                <description>Timer Interrupt Status: OR’ed (TMR_DN AND TMR_EN) flags. 1 when timer is enabled and countdown is done</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RXIS</name>
                <description>Rx Interrupt Status, RX buffer data available equal to PTP_RX_STS.AV)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TXIS</name>
                <description>Tx Done Interrupt Status: OR’ed PTP_TX_DONE</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_PTP_TX_STS</name>
            <description>No description available</description>
            <addressOffset>0x1010</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>STS</name>
                <description>Transmission status of PTP TX bin n (bit 0 – 7 correspond to tx bin 0 – 7). 1: transmission pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_PTP_TX_DONE</name>
            <description>No description available</description>
            <addressOffset>0x1014</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>DONE</name>
                <description>Transmission done status of PTP TX bin n (bit 0 – 7 correspond to tx bin 0 – 7). 1: transmission done.
Writing a ‘1’ clears corresponding bit..</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_PTP_TX_TRIG</name>
            <description>No description available</description>
            <addressOffset>0x1018</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TRIG</name>
                <description>Trigger PTP TX bin n (bit 0 – 7 correspond to tx bin 0 –7). Writing ‘1’ will trigger transmission. Corresponding bit PTP_TX_STS.STS(n) will be set immediately.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_PTP_RX_STS</name>
            <description>No description available</description>
            <addressOffset>0x101c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xC0000007</resetMask>
            <fields>
              <field>
                <name>OV</name>
                <description>FIFO overflow flag. PTP frame has been received and there was no free buffer available. Data has been lost.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AV_NXT</name>
                <description>Read access: buffer data available – reading data from RX_BUF is valid.
Write access: switch to next RX buffer – shall only be done when buffer not empty (AV=1). Use field RX_SEL as indication when rx buffer switch has been done.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_SEL</name>
                <description>Current selected RX buffer for reading (0-7). Can be used to determine when RX buffer has been switched after setting PTP_RX_STS.NXT</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>5</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSYN_TMR0,TSYN_TMR1,TSYN_TMR2,TSYN_TMR3,TSYN_TMR4</dimIndex>
            <name>TSYNTMR[%s]</name>
            <description>no description available</description>
            <addressOffset>0x1020</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000FFFFF</resetMask>
            <fields>
              <field>
                <name>PERIOD</name>
                <description>Period in ticks, ticks based on register HCLKDIV and host clock &lt;sys_clk&gt;.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_HCLKDIV</name>
            <description>No description available</description>
            <addressOffset>0x103c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000FFFFF</resetMask>
            <fields>
              <field>
                <name>PERIOD</name>
                <description>Period in host clocks &lt;sys_clk&gt;. Host clock shall be scaled to ticks of 1/1024th second. Ticks are used by timer TMR0 – TMR4.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_RXBUF_RX_FRAME_LENGTH_BYTES</name>
            <description>No description available</description>
            <addressOffset>0x1600</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000FFF</resetMask>
            <fields>
              <field>
                <name>RX_FRAME_LENGTH_BYTES</name>
                <description>RX frame length bytes [11:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_RXBUF_RX_TIME_STAMP_L</name>
            <description>No description available</description>
            <addressOffset>0x1608</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_TIMESTAMP_LOW</name>
                <description>RX Timestamp [31:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSYN_RXBUF_RX_TIME_STAMP_H</name>
            <description>No description available</description>
            <addressOffset>0x160c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_TIMESTAMP_HIGH</name>
                <description>RX Timestamp [63:32]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
