RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
          <register>
            <dim>60</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSYN_RXBUF_DATA_WORD0,TSYN_RXBUF_DATA_WORD1,TSYN_RXBUF_DATA_WORD2,TSYN_RXBUF_DATA_WORD3,TSYN_RXBUF_DATA_WORD4,TSYN_RXBUF_DATA_WORD5,TSYN_RXBUF_DATA_WORD6,TSYN_RXBUF_DATA_WORD7,TSYN_RXBUF_DATA_WORD8,TSYN_RXBUF_DATA_WORD9,TSYN_RXBUF_DATA_WORD10,TSYN_RXBUF_DATA_WORD11,TSYN_RXBUF_DATA_WORD12,TSYN_RXBUF_DATA_WORD13,TSYN_RXBUF_DATA_WORD14,TSYN_RXBUF_DATA_WORD15,TSYN_RXBUF_DATA_WORD16,TSYN_RXBUF_DATA_WORD17,TSYN_RXBUF_DATA_WORD18,TSYN_RXBUF_DATA_WORD19,TSYN_RXBUF_DATA_WORD20,TSYN_RXBUF_DATA_WORD21,TSYN_RXBUF_DATA_WORD22,TSYN_RXBUF_DATA_WORD23,TSYN_RXBUF_DATA_WORD24,TSYN_RXBUF_DATA_WORD25,TSYN_RXBUF_DATA_WORD26,TSYN_RXBUF_DATA_WORD27,TSYN_RXBUF_DATA_WORD28,TSYN_RXBUF_DATA_WORD29,TSYN_RXBUF_DATA_WORD30,TSYN_RXBUF_DATA_WORD31,TSYN_RXBUF_DATA_WORD32,TSYN_RXBUF_DATA_WORD33,TSYN_RXBUF_DATA_WORD34,TSYN_RXBUF_DATA_WORD35,TSYN_RXBUF_DATA_WORD36,TSYN_RXBUF_DATA_WORD37,TSYN_RXBUF_DATA_WORD38,TSYN_RXBUF_DATA_WORD39,TSYN_RXBUF_DATA_WORD40,TSYN_RXBUF_DATA_WORD41,TSYN_RXBUF_DATA_WORD42,TSYN_RXBUF_DATA_WORD43,TSYN_RXBUF_DATA_WORD44,TSYN_RXBUF_DATA_WORD45,TSYN_RXBUF_DATA_WORD46,TSYN_RXBUF_DATA_WORD47,TSYN_RXBUF_DATA_WORD48,TSYN_RXBUF_DATA_WORD49,TSYN_RXBUF_DATA_WORD50,TSYN_RXBUF_DATA_WORD51,TSYN_RXBUF_DATA_WORD52,TSYN_RXBUF_DATA_WORD53,TSYN_RXBUF_DATA_WORD54,TSYN_RXBUF_DATA_WORD55,TSYN_RXBUF_DATA_WORD56,TSYN_RXBUF_DATA_WORD57,TSYN_RXBUF_DATA_WORD58,TSYN_RXBUF_DATA_WORD59</dimIndex>
            <name>RXDATA[%s]</name>
            <description>no description available</description>
            <addressOffset>0x1610</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RXBUF_DATA_WORD</name>
                <description>RXBUF_DATA_WORD</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x100</dimIncrement>
            <dimIndex>tx0,tx1,tx2,tx3,tx4,tx5,tx6,tx7</dimIndex>
            <name>BIN[%s]</name>
            <description>no description available</description>
            <addressOffset>0x1800</addressOffset>
            <register>
              <dim>60</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>TSYN_TXBUF_BIN0_DATA_WORD0,TSYN_TXBUF_BIN0_DATA_WORD1,TSYN_TXBUF_BIN0_DATA_WORD2,TSYN_TXBUF_BIN0_DATA_WORD3,TSYN_TXBUF_BIN0_DATA_WORD4,TSYN_TXBUF_BIN0_DATA_WORD5,TSYN_TXBUF_BIN0_DATA_WORD6,TSYN_TXBUF_BIN0_DATA_WORD7,TSYN_TXBUF_BIN0_DATA_WORD8,TSYN_TXBUF_BIN0_DATA_WORD9,TSYN_TXBUF_BIN0_DATA_WORD10,TSYN_TXBUF_BIN0_DATA_WORD11,TSYN_TXBUF_BIN0_DATA_WORD12,TSYN_TXBUF_BIN0_DATA_WORD13,TSYN_TXBUF_BIN0_DATA_WORD14,TSYN_TXBUF_BIN0_DATA_WORD15,TSYN_TXBUF_BIN0_DATA_WORD16,TSYN_TXBUF_BIN0_DATA_WORD17,TSYN_TXBUF_BIN0_DATA_WORD18,TSYN_TXBUF_BIN0_DATA_WORD19,TSYN_TXBUF_BIN0_DATA_WORD20,TSYN_TXBUF_BIN0_DATA_WORD21,TSYN_TXBUF_BIN0_DATA_WORD22,TSYN_TXBUF_BIN0_DATA_WORD23,TSYN_TXBUF_BIN0_DATA_WORD24,TSYN_TXBUF_BIN0_DATA_WORD25,TSYN_TXBUF_BIN0_DATA_WORD26,TSYN_TXBUF_BIN0_DATA_WORD27,TSYN_TXBUF_BIN0_DATA_WORD28,TSYN_TXBUF_BIN0_DATA_WORD29,TSYN_TXBUF_BIN0_DATA_WORD30,TSYN_TXBUF_BIN0_DATA_WORD31,TSYN_TXBUF_BIN0_DATA_WORD32,TSYN_TXBUF_BIN0_DATA_WORD33,TSYN_TXBUF_BIN0_DATA_WORD34,TSYN_TXBUF_BIN0_DATA_WORD35,TSYN_TXBUF_BIN0_DATA_WORD36,TSYN_TXBUF_BIN0_DATA_WORD37,TSYN_TXBUF_BIN0_DATA_WORD38,TSYN_TXBUF_BIN0_DATA_WORD39,TSYN_TXBUF_BIN0_DATA_WORD40,TSYN_TXBUF_BIN0_DATA_WORD41,TSYN_TXBUF_BIN0_DATA_WORD42,TSYN_TXBUF_BIN0_DATA_WORD43,TSYN_TXBUF_BIN0_DATA_WORD44,TSYN_TXBUF_BIN0_DATA_WORD45,TSYN_TXBUF_BIN0_DATA_WORD46,TSYN_TXBUF_BIN0_DATA_WORD47,TSYN_TXBUF_BIN0_DATA_WORD48,TSYN_TXBUF_BIN0_DATA_WORD49,TSYN_TXBUF_BIN0_DATA_WORD50,TSYN_TXBUF_BIN0_DATA_WORD51,TSYN_TXBUF_BIN0_DATA_WORD52,TSYN_TXBUF_BIN0_DATA_WORD53,TSYN_TXBUF_BIN0_DATA_WORD54,TSYN_TXBUF_BIN0_DATA_WORD55,TSYN_TXBUF_BIN0_DATA_WORD56,TSYN_TXBUF_BIN0_DATA_WORD57,TSYN_TXBUF_BIN0_DATA_WORD58,TSYN_TXBUF_BIN0_DATA_WORD59</dimIndex>
              <name>TXDATA[%s]</name>
              <description>no description available</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TXBUF_BIN0_DATA_WORD0</name>
                  <description>TXBUF_BIN0_DATA_WORD0</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN</name>
              <description>No description available</description>
              <addressOffset>0xf0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x070000FF</resetMask>
              <fields>
                <field>
                  <name>TXBUF_BIN0_TQUE</name>
                  <description>TXBUF_BIN0_TQUE</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>TXBUF_BIN0_TX_LEN</name>
                  <description>TXBUF_BIN0_TX_LEN</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TSYN_TXBUF_BIN0_TX_TIMESTAMP_L</name>
              <description>No description available</description>
              <addressOffset>0xf8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TXBUF_BIN0_TX_TIMESTAMP_L</name>
                  <description>TXBUF_BIN0_TX_TIMESTAMP_L</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TSYN_TXBUF_BIN0_TX_TIMESTAMP_H</name>
              <description>No description available</description>
              <addressOffset>0xfc</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>TXBUF_BIN0_TX_TIMESTAMP_H</name>
                  <description>TXBUF_BIN0TX_TIMESTAMP_H</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>TSN_SHAPER_HWCFG1</name>
            <description>No description available</description>
            <addressOffset>0x2004</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LWIDTH</name>
                <description>Scheduler list address width (IP core parameter LWIDTH)</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TQC</name>
                <description>Traffic queue count (IP core parameter TQC)</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TQD</name>
                <description>Traffic queue depth (IP core parameter TQD)</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DW</name>
                <description>Traffic queue data width (Bytes); fixed to value 4 within
IP core</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TQAV</name>
            <description>No description available</description>
            <addressOffset>0x200c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>AVIE</name>
                <description>Traffic queue interrupt enable on buffer space available,
one bit per traffic queue
Bit[i] = 0: no interrupt
Bit[i] = 1: interrupt, when AVAIL[i]=1</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AVAIL</name>
                <description>Traffic queue buffer space available for complete packet of size MaxSDU (register MXSDUi)
Bit[i] = 1: space available
Bit[i] = 0: no space available or TQ not implemented (I &gt;= TQC)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_TQEM</name>
            <description>No description available</description>
            <addressOffset>0x2010</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>EMPTY</name>
                <description>Traffic queue empty
Bit[i] = 1: traffic queue i is empty</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_FPST</name>
            <description>No description available</description>
            <addressOffset>0x2014</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>TABLE</name>
                <description>Frame Preemption Status Table,
Bit[i] = 1: Preemptable traffic in TQ[i], otherwise
Express traffic (default)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_MMCT</name>
            <description>No description available</description>
            <addressOffset>0x2018</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>RQREL</name>
                <description>Request HOLD-Signal release operation. Will be automatically set to &lt;0&gt;</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQHLD</name>
                <description>Request HOLD-Signal hold operation. Will be automatically set to &lt;0&gt;.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_SHAPER_HOLDADV</name>
            <description>No description available</description>
            <addressOffset>0x201c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>VALUE</name>
                <description>holdAdvance time for TAS operation Set-And-Hold-MAC in &lt;sys_clk&gt; cycles</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSN_SHAPER_MXSDU0,TSN_SHAPER_MXSDU1,TSN_SHAPER_MXSDU2,TSN_SHAPER_MXSDU3,TSN_SHAPER_MXSDU4,TSN_SHAPER_MXSDU5,TSN_SHAPER_MXSDU6,TSN_SHAPER_MXSDU7</dimIndex>
            <name>MXSDU[%s]</name>
            <description>no description available</description>
            <addressOffset>0x2100</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>SDU</name>
                <description>Maximum SDU size for traffic queue n (n = 0 – 7)Returns 0 when n &gt; TQC. Value is size in words (32 bit word size).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSN_SHAPER_TXSEL0,TSN_SHAPER_TXSEL1,TSN_SHAPER_TXSEL2,TSN_SHAPER_TXSEL3,TSN_SHAPER_TXSEL4,TSN_SHAPER_TXSEL5,TSN_SHAPER_TXSEL6,TSN_SHAPER_TXSEL7</dimIndex>
            <name>TXSEL[%s]</name>
            <description>no description available</description>
            <addressOffset>0x2120</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>CBS_EN</name>
                <description>CBS enable traffic queue n (n = 0 – 7). Returns 0 when n &gt; TQC. Must be 0 when changing register IDSLPi.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>TSN_SHAPER_IDSEL0,TSN_SHAPER_IDSEL1,TSN_SHAPER_IDSEL2,TSN_SHAPER_IDSEL3,TSN_SHAPER_IDSEL04,TSN_SHAPER_IDSEL5,TSN_SHAPER_IDSEL6,TSN_SHAPER_IDSEL7</dimIndex>
            <name>IDSEL[%s]</name>
            <description>no description available</description>
            <addressOffset>0x2140</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000FFFFF</resetMask>
            <fields>
              <field>
                <name>INT</name>
                <description>CBS idle slope for traffic queue n (n = 0 – 7). Returns
0 when n &gt; TQC. The register must only be written
when TXSELi.CBE_EN=0.
The idle slope value is defined as (INT + FRACT /
65536). The idle slope is set in bits per tick related to
&lt;tx_clk&gt;.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRACT</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PORT1_QCH0_CFG</name>
            <description>qch channel0 control</description>
            <addressOffset>0x2800</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00177FF1</resetMask>
            <fields>
              <field>
                <name>CQF_IN_ERR</name>
                <description>qch queue in error</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CQF_NUM</name>
                <description>qch queue destination buffer select</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TAS_GPIO_SEL</name>
                <description>tas_gpio select</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AXIS_QCH_EN</name>
                <description>qch queue in select</description>
                <bitOffset>4</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CQF_EN</name>
                <description>qch enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PORT1_QCH1_CFG</name>
            <description>qch channel1 control</description>
            <addressOffset>0x2804</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00177FF1</resetMask>
            <fields>
              <field>
                <name>CQF_IN_ERR</name>
                <description>qch queue in error</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CQF_NUM</name>
                <description>qch queue destination buffer select</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TAS_GPIO_SEL</name>
                <description>tas_gpio select</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AXIS_QCH_EN</name>
                <description>qch queue in select</description>
                <bitOffset>4</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CQF_EN</name>
                <description>qch enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PORT1_QCH2_CFG</name>
            <description>qch channel2 control</description>
            <addressOffset>0x2808</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00177FF1</resetMask>
            <fields>
              <field>
                <name>CQF_IN_ERR</name>
                <description>qch queue in error</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CQF_NUM</name>
                <description>qch queue destination buffer select</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TAS_GPIO_SEL</name>
                <description>tas_gpio select</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AXIS_QCH_EN</name>
                <description>qch queue in select</description>
                <bitOffset>4</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CQF_EN</name>
                <description>qch enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PORT1_QCH3_CFG</name>
            <description>qch channel3 control</description>
            <addressOffset>0x280c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00177FF1</resetMask>
            <fields>
              <field>
                <name>CQF_IN_ERR</name>
                <description>qch queue in error</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>CQF_NUM</name>
                <description>qch queue destination buffer select</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TAS_GPIO_SEL</name>
                <description>tas_gpio select</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>AXIS_QCH_EN</name>
                <description>qch queue in select</description>
                <bitOffset>4</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CQF_EN</name>
                <description>qch enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
