RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
          <register>
            <name>TSN_EP_TSF_SR</name>
            <description>No description available</description>
            <addressOffset>0xf02c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x800000FF</resetMask>
            <fields>
              <field>
                <name>TSF_OV</name>
                <description>Overflow of Tx-Timestamp-Fifo. At least one transmitted packet has been sent and timestamp was not stored; write bit to clear flag</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TSF_USED</name>
                <description>Tx-Timestamp-Fifo currently used entries counter; reading of TSF_Dx is only valid if field value &gt; 0. Any read from TSF_D2 will decrement counter (unless already 0).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_MMS_CTRL</name>
            <description>No description available</description>
            <addressOffset>0xf030</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>STATSEL</name>
                <description>MMS statistic counter selection, value can be read in register
MMS_STAT
&lt;000&gt;: Frame reassembly error counter (802.3br, 30.14.1.8)
&lt;001&gt;: Frames rejected due to wrong SMD (802.3br, 30.14.1.9)
&lt;010&gt;: Frame assembly ok counter (802.3br, 30.14.1.10)
&lt;011&gt;: Fragment rx counter (802.3br, 30.14.1.11)
&lt;100&gt;: Fragment tx counter (802.3br, 30.14.1.12)
&lt;101&gt;: Hold request counter (802.3br, 30.14.1.13)
otherwise: &lt;0&gt;</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FRAGSZ</name>
                <description>Minimum non-final fragment size: 64 x (1 + FRAGSZ) – 4 octets</description>
                <bitOffset>3</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DISV</name>
                <description>Disable verification</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>LINK</name>
                <description>Link error</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Enable preemption</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_MMS_STS</name>
            <description>No description available</description>
            <addressOffset>0xf034</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000007</resetMask>
            <fields>
              <field>
                <name>VFAIL</name>
                <description>802.3br verification state failure; verification is done when any bit VFAIL or VOK is &lt;1&gt;</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>VOK</name>
                <description>802.3br verification state ok; verification is done when any bit VFAIL or VOK is &lt;1&gt;</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HLD</name>
                <description>HOLD-Signal</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_MMS_VTIME</name>
            <description>No description available</description>
            <addressOffset>0xf038</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VTIME</name>
                <description>802.3br verification timeout counter in &lt;sys_clk&gt; cycles. Must be set by software in range of 1ms to 128ms.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_MMS_STAT</name>
            <description>No description available</description>
            <addressOffset>0xf03c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>Statistic counter of MMS, selected by MMS_CTRL.STATSEL,any write access will clear selected counter</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_PTP_UPTM_NS</name>
            <description>No description available</description>
            <addressOffset>0xf040</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>UPTM_NS</name>
                <description>PTP SYNC frame “upstreamTxTime” in format “seconds.nanoseconds” as potentially received by another TSN-EP port. The correction field of a transmitted PTP SYNC frame is modified by (egressTimestamp –upstreamTxTime), relative to the LocalClock. The “rateRatio” to the Grandmaster Clock is not taken into account.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_PTP_UPTM_S</name>
            <description>No description available</description>
            <addressOffset>0xf044</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>UPTM_NS</name>
                <description>No description available</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TSN_EP_PTP_SR</name>
            <description>No description available</description>
            <addressOffset>0xf048</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0000FFFF</resetMask>
            <fields>
              <field>
                <name>MEAS_NS</name>
                <description>Measured value of the deviation of the early timestamping for PTP frames. This value is informational only. The deviation is already included to the corrected “correctionField”.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_CTRL_PORT_MAIN_TAGGING</name>
            <description>PVID Tagging Register</description>
            <addressOffset>0x10000</addressOffset>
            <size>32</size>
            <resetValue>0x00000001</resetValue>
            <resetMask>0x0003FFFF</resetMask>
            <fields>
              <field>
                <name>FORCE</name>
                <description>The VLAN-TAG with PVID will be inserted in every frame from Host as their first VLAN-TAG. This can be used for double tagging of tagged/trunk ports</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ACCESS</name>
                <description>Every tagged frame not matching PVID is filtered out. Every untagged ingress  frame will be tagged with PVID. Every egress frame with PVID will be untagged</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PCP</name>
                <description>VLAN-TCI: Priority Code Point, used when tagged.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DEI</name>
                <description>VLAN-TCI: Drop Eligible Indicator, used when tagged.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PVID</name>
                <description>Native VLAN of Port. Untagged traffic will be tagged with the native VLAN-ID By default the Port uses VLAN 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_CTRL_PORT_MAIN_ENNABLE</name>
            <description>Port Module Enable Register</description>
            <addressOffset>0x10004</addressOffset>
            <size>32</size>
            <resetValue>0x00000003</resetValue>
            <resetMask>0x00000003</resetMask>
            <fields>
              <field>
                <name>EN_SF</name>
                <description>only applicable for CPU-Port at egress: '1' to use S&amp;F FIFO and '0' disable S&amp;F FIFO. Changing during frame operation can lead to frame corruption</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_QCI</name>
                <description>if QCI is present at selected egress port, '1' to use QCI and '0' disable QCI. Changing during frame operation can lead to frame corruption.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_CTRL_EGRESS_ECSR_QDROP</name>
            <description>No description available</description>
            <addressOffset>0x12000</addressOffset>
            <size>32</size>
            <resetValue>0x0001FFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DIS_VEC</name>
                <description>disable drop for each queue when queue not free</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN_VEC</name>
                <description>Enable/Disable drop in egress when TSN queue not free.
1 - drop enabled
0 - drop disabled
TSN-SW:
bit[i] - from Port[i]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x100</dimIncrement>
            <dimIndex>e1,p1</dimIndex>
            <name>RXFIFO[%s]</name>
            <description>no description available</description>
            <addressOffset>0x14000</addressOffset>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_CNT_BYTE</name>
              <description>No description available</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>FDMEM_CNT_BYTE</name>
                  <description>Number of bytes stored in frame drop FIFO</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>32</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_STS</name>
              <description>No description available</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x00000F0F</resetMask>
              <fields>
                <field>
                  <name>WAIT_FOR_LU</name>
                  <description>FD FIFO waits for LookUp information.</description>
                  <bitOffset>11</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>WAIT_FOR_FRAME</name>
                  <description>FD FIFO waits for more frame data.</description>
                  <bitOffset>10</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>BUSY</name>
                  <description>FD FIFO processes data.</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>READY</name>
                  <description>FD FIFO ready to work or working.</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FULL</name>
                  <description>FD FIFO full</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>AMST_FULL</name>
                  <description>FD FIFO almost full. Less than 1600 Byte left.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>AMST_EMPTY</name>
                  <description>FD FIFO almost empty. Few bytes in FIFO.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>EMPTY</name>
                  <description>FD FIFO empty</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_ERROR_FLAG</name>
              <description>No description available</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0000007F</resetMask>
              <fields>
                <field>
                  <name>LU_DESC_ERR</name>
                  <description>LookUp Descriptor lost, because of unknown frame burst by MAC. If there is no  MAC mailfunction then this flag will never be raised. FDFIFO requires reset.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>WRFAIL_FULL</name>
                  <description>Set if a frame is partially written into FIFO which had insufficient space. The frame is cut and frame error is set.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DROP_NRDY</name>
                  <description>Frame was dropped because the FIFO was not ready. That can typically happen after a reset of the FIFO</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DROP_FULL_DESC</name>
                  <description>Frame was dropped because the internal descriptor FIFO is full. Full by too many frames.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DROP_FULL_MEM</name>
                  <description>Frame was dropped because the FIFO is full. Full by too much data.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DESC_NRDY_ERR</name>
                  <description>FD FIFO failure. Descriptor not received correctly.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DESC_SEQ_ERR</name>
                  <description>FD FIFO failure. Internal controller lost synchronization.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_IE_ERROR_FLAG</name>
              <description>No description available</description>
              <addressOffset>0xc</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x0000007F</resetMask>
              <fields>
                <field>
                  <name>IE</name>
                  <description>Interrupt enable of ERROR_FLAG.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>7</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_IN_CONFIG</name>
              <description>No description available</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x00000001</resetMask>
              <fields>
                <field>
                  <name>NOCUT_ERROR</name>
                  <description>FD_FIFO does not shorten frames which contain an error.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
