RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_OUT_CONFIG</name>
              <description>No description available</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFF037F</resetMask>
              <fields>
                <field>
                  <name>DROP_DEST</name>
                  <description>Bit mapped Destination for dropped frames. Typically, frames are cleared at destination 0. Use another value to stream frames for analysis. Supports only max range of port[15:0].</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MIRROR_TX_EN</name>
                  <description>Incoming frames of this port will be mirrored to the given destination in MIRROR if their destination match with MIRROR_TX.</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MIRROR_RX_EN</name>
                  <description>Incoming frames of this port will be mirrored to the given destination in MIRROR_RX.</description>
                  <bitOffset>8</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CT_FPE_OVRD</name>
                  <description>If any Store&amp;Forward option in RX_FDFIFO is set then this flag will still force preemptable traffic to be forwarded in Cut-Through mode. This is a useful option to save latency by double buffering if the used MAC/TSN-EP already does S&amp;F.</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DISABLE</name>
                  <description>Disable input of FD FIFO. Take care that also descriptor generation of LookUp is disabled. Remaining frames should be cleared with DROP_ALL.</description>
                  <bitOffset>5</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DROP_ALL</name>
                  <description>Route all frames to DROP_DEST.</description>
                  <bitOffset>4</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ERROR_TO_CPU</name>
                  <description>Send error frames to CPU.</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MIRROR_TO_CPU</name>
                  <description>Duplicate frames to CPU.</description>
                  <bitOffset>2</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>NODROP_ERROR</name>
                  <description>Do not drop frame errors.</description>
                  <bitOffset>1</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MODE_STORE_FW</name>
                  <description>Switch between Cut-Through and Store&amp;Forward mode. 0 - Cut-Through 1 - Store&amp;Forward</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_RESET</name>
              <description>No description available</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x00000001</resetMask>
              <fields>
                <field>
                  <name>SOFTRS</name>
                  <description>Write 1 to reset FD controller and memory pointers. Register Map content remains untouched</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>write-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_PARAM</name>
              <description>No description available</description>
              <addressOffset>0x1c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>LU_FIFO_DEPTH</name>
                  <description>Number of MAC lookup descriptors the FIFO can store.</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FD_DESC_FIFO_DESC</name>
                  <description>Number of FD descriptors the FIFO can store. Two descriptors need to be stored per frame.</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>8</bitWidth>
                  <access>read-only</access>
                </field>
                <field>
                  <name>FD_FIFO_DESC</name>
                  <description>Number of words (4byte) the Frame Drop FIFO can store.</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_STRFWD</name>
              <description>No description available</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x01FFFFFF</resetMask>
              <fields>
                <field>
                  <name>PORT</name>
                  <description>If selected port is set then the frame is transmitted in Store &amp; Forward mode. This is necessary when the ingress rate of this port is slower than the egress rate of the transmitting port. In S&amp;F, the ingress module is able to drop frames with bad CRC.bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>25</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_PORTMASK</name>
              <description>No description available</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <resetValue>0x001FFFFF</resetValue>
              <resetMask>0x01FFFFFF</resetMask>
              <fields>
                <field>
                  <name>PORT</name>
                  <description>Port grouping via port mask. If the selected port is not set then the destination will be filtered out. This register allows the realization of port-based-VLAN (no VLAN tags required, only set it by ports).
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>25</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR</name>
              <description>No description available</description>
              <addressOffset>0x28</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x01FFFFFF</resetMask>
              <fields>
                <field>
                  <name>PORT</name>
                  <description>Mirror Port. If port mirroring is enabled TX/RX traffic will also be forwarded to this port.
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>25</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR_TX</name>
              <description>No description available</description>
              <addressOffset>0x2c</addressOffset>
              <size>32</size>
              <resetValue>0x00000000</resetValue>
              <resetMask>0x01FFFFFF</resetMask>
              <fields>
                <field>
                  <name>PORT</name>
                  <description>Mirror Selection TX. The destination of the frame is compared with this vector. All matching TX probe ports will be mirrored to MIRROR. It is necessary to configure all ingress ports to mirror the complete TX traffic.
bit 0 - CPU-Port,
bit 1 - Port 1, …</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>25</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>SW_CTRL_MONITOR_CTRL</name>
            <description>No description available</description>
            <addressOffset>0x18004</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>EN</name>
                <description>Enables counter. If deasserted the counter process stops and the counters hold their value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_CTRL_MONITOR_RESET</name>
            <description>No description available</description>
            <addressOffset>0x18008</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000007</resetMask>
            <fields>
              <field>
                <name>RSRX</name>
                <description>Write '1' to reset all RX counters.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RSTX</name>
                <description>Write '1' to reset all TX counters</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>RSALL</name>
                <description>Write '1' to reset all TX&amp;RX counters.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SW_CTRL_MONITOR_PARAM</name>
            <description>No description available</description>
            <addressOffset>0x1800c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFF7F</resetMask>
            <fields>
              <field>
                <name>RX_CNT_EN_VEC</name>
                <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter are available.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_CNT_EN_VEC</name>
                <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter are available.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>CNTW</name>
                <description>Vector of implemented RX counters. E.g. 0x000F means only the first 4 RX counter
are available.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_TX_COUNTER_TX_FGOOD</name>
            <description>No description available</description>
            <addressOffset>0x18010</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TX_FGOOD</name>
                <description>Good transmitted Frames to TX TSN-EP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_TX_COUNTER_TX_FERROR</name>
            <description>No description available</description>
            <addressOffset>0x18018</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TX_FERROR</name>
                <description>Transmitted Frames with Error to TX TSN-EP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_TX_COUNTER_TX_DROP_OVFL</name>
            <description>No description available</description>
            <addressOffset>0x18020</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TX_DROP_OVFL</name>
                <description>Dropped frames by full queue of TSN-EP.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_FGOOD</name>
            <description>No description available</description>
            <addressOffset>0x18040</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_FGOOD</name>
                <description>Good received frame by ingress buffer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_FERROR</name>
            <description>No description available</description>
            <addressOffset>0x18048</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_FERROR</name>
                <description>Bad received frame by ingress buffer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_KNOWN</name>
            <description>No description available</description>
            <addressOffset>0x18050</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_KNOWN</name>
                <description>Number of frames passed ingress with hit by MAC Table. This includes Broadcast and non-relayed frames.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_UNKNOWN</name>
            <description>No description available</description>
            <addressOffset>0x18058</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_UNKNOWN</name>
                <description>Number of frames passed ingress without hit by MAC table.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_UC</name>
            <description>No description available</description>
            <addressOffset>0x18060</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_UC</name>
                <description>Number of unicast frames</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_INTERN</name>
            <description>No description available</description>
            <addressOffset>0x18068</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_INTERN</name>
                <description>Number of non-relay frames</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_BC</name>
            <description>No description available</description>
            <addressOffset>0x18070</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_BC</name>
                <description>Number of Broadcast frames</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_MULTI</name>
            <description>No description available</description>
            <addressOffset>0x18078</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_MULTI</name>
                <description>Number of Multicast frames</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_VLAN</name>
            <description>No description available</description>
            <addressOffset>0x18080</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_VLAN</name>
                <description>Number of VLAN tagged frames</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_DROP_OVFL</name>
            <description>No description available</description>
            <addressOffset>0x18088</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_DROP_OVFL</name>
                <description>Dropped frames by ingress overflow.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_DROP_LU</name>
            <description>No description available</description>
            <addressOffset>0x18090</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_DROP_LU</name>
                <description>Dropped frames by LookUp decision.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_DROP_ERR</name>
            <description>No description available</description>
            <addressOffset>0x18098</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_DROP_ERR</name>
                <description>Dropped frames with error by ingress. Possible in S&amp;F mode or when frame is queued in ingress.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MONITOR_RX_COUNTER_RX_DROP_VLAN</name>
            <description>No description available</description>
            <addressOffset>0x180a0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RX_DROP_VLAN</name>
                <description>Dropped frames by incompatible VLAN.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
