RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
        <register>
          <name>AL_EVT_REQ</name>
          <description>AL Event Request</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFF7F</resetMask>
          <fields>
            <field>
              <name>SM_INT</name>
              <description>SyncManager interrupts (SyncManager
register offset 0x5, bit [0] or [1]):
0:No SyncManager 0 interrupt
1:SyncManager 0 interrupt pending
0:No SyncManager 1 interrupt
1:SyncManager 1 interrupt pending
…
0:No SyncManager 15 interrupt
1:SyncManager 15 interrupt pending</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDG_PD</name>
              <description>Watchdog Process Data:
0:Has not expired
1:Has expired
(Bit is cleared by reading Watchdog Status
Process Data 0x0440 from PDI)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EE_EMU</name>
              <description>EEPROM Emulation:
0:No command pending
1:EEPROM command pending
(Bit is cleared by acknowledging the
command in EEPROM Control/Status
register 0x0502:0x0503[10:8] from PDI)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SM_ACT</name>
              <description>SyncManager activation register
(SyncManager register offset 0x6) changed:
0:No change in any SyncManager
1:At least one SyncManager changed
(Bit is cleared by reading SyncManager
Activation registers 0x0806 etc. from PDI)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DC_SYNC1</name>
              <description>State of DC SYNC1 (if register
0x0151[7]=1):
(Bit is cleared by reading of SYNC1 status
0x098F from PDI, use only in Acknowledge
mode)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DC_SYNC0</name>
              <description>State of DC SYNC0 (if register
0x0151[3]=1):
(Bit is cleared by reading SYNC0 status
0x098E from PDI, use only in Acknowledge
mode)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCL_EVT</name>
              <description>DC Latch event:
0:No change on DC Latch Inputs
1:At least one change on DC Latch Inputs
(Bit is cleared by reading DC Latch event
times from PDI, so that Latch 0/1 Status
0x09AE:0x09AF indicates no event. Available
if Latch Unit is PDI-controlled)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALC_EVT</name>
              <description>AL Control event:
0:No AL Control Register change
1:AL Control Register has been written3
(Bit is cleared by reading AL Control register
0x0120:0x0121 from PDI)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x2</dimIncrement>
          <dimIndex>PORT0,PORT1,PORT2,PORT3</dimIndex>
          <name>RX_ERR_CNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x300</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RX_ERR</name>
              <description>RX Error counter of Port y (counting is
stopped when 0xFF is reached).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IVD_FRM</name>
              <description>Invalid frame counter of Port y (counting is
stopped when 0xFF is reached).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>PORT0,PORT1,PORT2,PORT3</dimIndex>
          <name>FWD_RX_ERR_CNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x308</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ERR_CNT</name>
              <description>Forwarded error counter of Port y (counting is
stopped when 0xFF is reached).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECAT_PU_ERR_CNT</name>
          <description>ECAT Processing Unit Error Counter</description>
          <addressOffset>0x30c</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>ECAT Processing Unit error counter
(counting is stopped when 0xFF is reached).
Counts errors of frames passing the
Processing Unit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_ERR_CNT</name>
          <description>PDI Error Counter</description>
          <addressOffset>0x30d</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>PDI Error counter (counting is stopped when
0xFF is reached). Counts if a PDI access has
an interface error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>PORT0,PORT1,PORT2,PORT3</dimIndex>
          <name>LOST_LINK_CNT[%s]</name>
          <description>no description available</description>
          <addressOffset>0x310</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Lost Link counter of Port y (counting is
stopped when 0xff is reached). Counts only if
port is open and loop is Auto.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_DIV</name>
          <description>Watchdog Divider</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <resetValue>0x09C2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Watchdog divider:Number of 25 MHz tics
(minus 2) that represent the basic watchdog
increment. (Default value is 100µs = 2498)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_TIME_PDI</name>
          <description>Watchdog Time PDI</description>
          <addressOffset>0x410</addressOffset>
          <size>16</size>
          <resetValue>0x03E8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Watchdog Time PDI:number of basic
watchdog increments
(Default value with Watchdog divider 100µs
means 100ms Watchdog)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_TIME_PDAT</name>
          <description>Watchdog Time Process Data</description>
          <addressOffset>0x420</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TIME</name>
              <description>Watchdog Time Process Data:number of
basic watchdog increments
(Default value with Watchdog divider 100µs
means 100ms Watchdog)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_STAT_PDAT</name>
          <description>Watchdog Status Process Data</description>
          <addressOffset>0x440</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <fields>
            <field>
              <name>ST</name>
              <description>Watchdog Status of Process Data (triggered
by SyncManagers)
0:Watchdog Process Data expired
1:Watchdog Process Data is active or
disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_CNT_PDAT</name>
          <description>Watchdog Counter Process Data</description>
          <addressOffset>0x442</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Watchdog Counter Process Data (counting is
stopped when 0xFF is reached). Counts if
Process Data Watchdog expires.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG_CNT_PDI</name>
          <description>Watchdog Counter PDI</description>
          <addressOffset>0x443</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>Watchdog PDI counter (counting is stopped
when 0xFF is reached). Counts if PDI
Watchdog expires.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_CFG</name>
          <description>EEPROM Configuration</description>
          <addressOffset>0x500</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <fields>
            <field>
              <name>FORCE_ECAT</name>
              <description>Force ECAT access:
0:Do not change Bit 0x0501[0]
1:Reset Bit 0x0501[0] to 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI</name>
              <description>EEPROM control is offered to PDI:
0:no
1:yes (PDI has EEPROM control)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_PDI_ACC_STAT</name>
          <description>EEPROM PDI Access State</description>
          <addressOffset>0x501</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <fields>
            <field>
              <name>ACCESS</name>
              <description>Access to EEPROM:
0:PDI releases EEPROM access
1:PDI takes EEPROM access (PDI has
EEPROM control)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_CTRL_STAT</name>
          <description>EEPROM Control/Status</description>
          <addressOffset>0x502</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFE1</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy:
0:EEPROM Interface is idle
1:EEPROM Interface is busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_WEN</name>
              <description>Error Write Enable*3
:
0:No error
1:Write Command without Write enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_ACK_CMD</name>
              <description>Error Acknowledge/Command*3
:
0:No error
1:Missing EEPROM acknowledge or invalid
command
EEPROM emulation only:PDI writes 1 if a temporary
failure has occurred.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EE_LDS</name>
              <description>EEPROM loading status:
0:EEPROM loaded, device information ok
1:EEPROM not loaded, device information not
available (EEPROM loading in progress or
finished with a failure)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CKSM_ERR</name>
              <description>Checksum Error in ESC Configuration Area:
0:Checksum ok
1:Checksum error
EEPROM emulation for IP Core only:PDI writes 1 if a
CRC failure has occurred for a reload command.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command register*2:
Write:Initiate command.
Read:Currently executed command
Commands:
000:No command/EEPROM idle (clear error bits)
001:Read
010:Write
100:Reload
Others:Reserved/invalid commands (do not issue)
EEPROM emulation only:after execution, PDI writes
command value to indicate operation is ready.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EE_ALGM</name>
              <description>Selected EEPROM Algorithm:
0:1 address byte (1Kbit – 16Kbit EEPROMs)
1:2 address bytes (32Kbit – 4 Mbit EEPROMs)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_RD_BYTE</name>
              <description>Supported number of EEPROM read bytes:
0:4 Bytes
1:8 Bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EE_EMU</name>
              <description>EPROM emulation:
0:Normal operation (I²C interface used)
1:PDI emulates EEPROM (I²C not used)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECAT_WEN</name>
              <description>ECAT write enable*2
:
0:Write requests are disabled
1:Write requests are enabled
This bit is always 1 if PDI has EEPROM control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_ADDR</name>
          <description>EEPROM Address</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>EEPROM Address
0:First word (= 16 bit)
1:Second word
…
Actually used EEPROM Address bits:
[9-0] : EEPROM size up to 16 Kbit
[17-0] : EEPROM size 32 Kbit – 4 Mbit
[31-0] : EEPROM Emulation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEPROM_DATA</name>
          <description>EEPROM Data</description>
          <addressOffset>0x508</addressOffset>
          <size>64</size>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HI</name>
              <description>EEPROM Read data (data read from
EEPROM, higher bytes)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LO</name>
              <description>EEPROM Write data (data to be written to
EEPROM) or
EEPROM Read data (data read from
EEPROM, lower bytes)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MII_MNG_CS</name>
          <description>MII Management Control/Status</description>
          <addressOffset>0x510</addressOffset>
          <size>16</size>
          <resetValue>0x0000</resetValue>
          <resetMask>0xE3FF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Busy:
0:MII Management Interface is idle
1:MII Management Interface is busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_ERR</name>
              <description>Command error:
0:Last Command was successful
1:Invalid command or write command
without Write Enable
Cleared by executing a valid command or by
writing “00” to Command register bits [9:8].</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RD_ERR</name>
              <description>Read error:
0:No read error
1:Read error occurred (PHY or register
not available)
Cleared by writing to register 0x0511</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>Command register*:
Write:Initiate command.
Read:Currently executed command
00:No command/MI idle (clear error bits)
01:Read
10:Write
Others:Reserved/invalid command (do not
issue)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_ADDR</name>
              <description>PHY address of port 0
(this is equal to the PHY address offset, if the
PHY addresses are consecutive)
IP Core since V3.0.0/3.00c:
Translation 0x0512[7]=0:
Register 0x0510[7:3] shows PHY address of
port 0
Translation 0x0512[7]=1:
Register 0x0510[7:3] shows the PHY address
which will be used for port 0-3 as requested
by 0x0512[4:0] (valid values 0-3)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LINK_DC</name>
              <description>MI link detection and configuration:
0:Disabled for all ports
1:Enabled for at least one MII port, refer
to PHY Port Status (0x0518 ff.) for
details</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDI</name>
              <description>Management Interface can be controlled by
PDI (registers 0x0516-0x0517):
0:Only ECAT control
1:PDI control possible</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WEN</name>
              <description>Write enable*:
0:Write disabled
1:Write enabled
This bit is always 1 if PDI has MI control.
ET1100-0000/-0001 exception:
Bit is not always 1 if PDI has MI control, and
bit is writable by PDI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_ADDR</name>
          <description>PHY Address</description>
          <addressOffset>0x512</addressOffset>
          <size>8</size>
          <resetValue>0x00</resetValue>
          <resetMask>0x9F</resetMask>
          <fields>
            <field>
              <name>SHOW</name>
              <description>Target PHY Address translation:
0:Enabled
1:Disabled
Refer to 0x0512[4:0] and 0x0510[7:3] for
details.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Target PHY Address
Translation 0x0512[7]=0:
0-3:Target PHY Addresses 0-3 are used
to access the PHYs at port 0-3, when
the PHY addresses are properly
configured
4-31:The configured PHY address of port 0
(PHY address offset) is added to the
Target PHY Address values 4-31
when accessing a PHY
Translation 0x0512[7]=1:
0-31:Target PHY Addresses is used when
accessing a PHY without translation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
