RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/HPM6E80/HPM6E80_svd.xml
        <register>
          <name>SDRCTRL2</name>
          <description>SDRAM Control Register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITO</name>
              <description>SDRAM Idle timeout
It closes all opened pages if the SDRAM idle time lasts more than idle timeout period. SDRAM is
considered idle when there is no AXI Bus transfer and no SDRAM command pending.
00000000b - IDLE timeout period is 256*Prescale period.
00000001-11111111b - IDLE timeout period is ITO*Prescale period.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2ACT</name>
              <description>ACT to ACT wait time
It is promised ACT2ACT+1 clock cycles delay between ACTIVE command to ACTIVE command. This
could help to meet tRRD timing requirement by SDRAM device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2REF</name>
              <description>Refresh to Refresh wait time
It is promised REF2REF+1 clock cycles delay between REFRESH command to REFRESH command.
This could help to meet tRFC timing requirement by SDRAM device.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRRC</name>
              <description>Self Refresh Recovery time
It is promised SRRC+1 clock cycles delay between Self-REFRESH command to any command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRCTRL3</name>
          <description>SDRAM Control Register 3</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>
          <fields>
            <field>
              <name>UT</name>
              <description>Refresh urgent threshold
Internal refresh request is generated on every Refresh period. Before internal request timer count up to
urgent request threshold, the refresh request is considered as normal refresh request. Normal refresh
request is handled in lower priority than any pending AXI command or IP command to SDRAM device.
When internal request timer count up to this urgent threshold, refresh request is considered as urgent
refresh request. Urgent refresh request is handled in higher priority than any pending AXI command or IP
command to SDRAM device.
NOTE: When urgent threshold is no less than refresh period, refresh request is always considered as
urgent refresh request.
Refresh urgent threshold is as follwoing:
00000000b - 256*Prescaler period
00000001-11111111b - UT*Prescaler period</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT</name>
              <description>Refresh timer period
Refresh timer period is as following:
00000000b - 256*Prescaler period
00000001-11111111b - RT*Prescaler period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescaler timer period
Prescaler timer period is as following:
00000000b - 256*16 clock cycles
00000001-11111111b - PRESCALE*16 clock cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REBL</name>
              <description>Refresh burst length
It could send multiple Auto-Refresh command in one burst when REBL is set to non-zero. The
number of Auto-Refresh command cycle sent to all SDRAM device in one refresh period is as following.
000b - 1
001b - 2
010b - 3
011b - 4
100b - 5
101b - 6
110b - 7
111b - 8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REN</name>
              <description>Refresh enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCTRL0</name>
          <description>SRAM control register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F01</resetMask>
          <fields>
            <field>
              <name>ADVH</name>
              <description>ADV hold state
0b - ADV is high during address hold state
1b - ADV is low during address hold state</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVP</name>
              <description>ADV polarity
0b - ADV is active low
1b - ADV is active high</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADM</name>
              <description>address data mode
00b - address and data MUX mode
11b - address and data non-MUX mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTSZ</name>
              <description>port size
0b - 8bit
1b - 16bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCTRL1</name>
          <description>SRAM control register 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEH</name>
              <description>OE high time, is OEH+1 clock cycles</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OEL</name>
              <description>OE low time, is OEL+1 clock cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEH</name>
              <description>WE high time, is WEH+1 clock cycles</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEL</name>
              <description>WE low time, is WEL+1 clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AH</name>
              <description>Address hold time, is AH+1 clock cycles</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Address setup time, is AS+1 clock cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEH</name>
              <description>Chip enable hold time, is CEH+1 clock cycles</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CES</name>
              <description>Chip enable setup time, is CES+1 clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR</name>
          <description>IP Command Control Register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>Slave address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATSZ</name>
          <description>IP Command Control Register 1</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>DATSZ</name>
              <description>Data Size in Byte
When IP command is not a write/read operation, DATSZ field would be ignored.
000b - 4
001b - 1
010b - 2
011b - 3
100b - 4
101b - 4
110b - 4
111b - 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BYTEMSK</name>
          <description>IP Command Control Register 2</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>BM3</name>
              <description>Byte Mask for Byte 3 (IPTXD bit 31:24)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM2</name>
              <description>Byte Mask for Byte 2 (IPTXD bit 23:16)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM1</name>
              <description>Byte Mask for Byte 1 (IPTXD bit 15:8)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM0</name>
              <description>Byte Mask for Byte 0 (IPTXD bit 7:0)
0b - Byte Unmasked
1b - Byte Masked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPCMD</name>
          <description>IP Command Register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>This field should be written with 0x5AA5 when trigging an IP command for all device types. The memory
device is selected by BRx settings and IPCR0 registers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CMD</name>
              <description>SDRAM Commands:
• 0x8: READ
• 0x9: WRITE
• 0xA: MODESET
• 0xB: ACTIVE
• 0xC: AUTO REFRESH
• 0xD: SELF REFRESH
• 0xE: PRECHARGE
• 0xF: PRECHARGE ALL
• Others: RSVD
NOTE: SELF REFRESH is sent to all SDRAM devices because they shared same CLK pin.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTX</name>
          <description>TX DATA Register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRX</name>
          <description>RX DATA Register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAT</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT0</name>
          <description>Status Register 0</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IDLE</name>
              <description>Indicating whether it is in IDLE state.
When IDLE=1, it is in IDLE state. There is no pending AXI command in internal queue and no
pending device access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYCFG</name>
          <description>Delay Line Config Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000203F</resetMask>
          <fields>
            <field>
              <name>OE</name>
              <description>delay clock output enable, should be set after setting DLYEN and DLYSEL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYSEL</name>
              <description>delay line select, 0 for 1 cell, 31 for all 32 cells</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYEN</name>
              <description>delay line enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
